examples/airfoil_optimization_working/baseCase/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "../Inputs"
dimensions      [0 2 -1 0 0 0 0];

// Freestream turbulent viscosity relative to nuFluid (see transport properties)
// Freestream nut = 0.009*nuFluid
// turbmodels.larc.nasa.gov/naca0012_val_sst.html (Retrieved August 20, 2020)

internalField   uniform $NUT;

boundaryField
{
    farfield
    {
        type            calculated;
        value           $internalField;
    }

    airfoil
    {
        type            nutkWallFunction;
        value           $internalField;
    }

    leftAndRight
    {
        type            empty;
    }
}


// ************************************************************************* //
